test/data/json/facebook/facebook_payments/payment_history.json

{
  "payments_v2": {
    "preferred_currency": "USD",
    "payments": [
      {
        "created_timestamp": 1602018456,
        "amount": "10.00",
        "currency": "USD",
        "sender": "Joe Walther",
        "receiver": "Shawn Hagene",
        "type": "Payment",
        "status": "Completed",
        "payment_data": {
          "p2p_payment": {
            "memo": "CITS RESEARCH COMPENSATION",
            "total_amount": "$10.00"
          }
        }
      },
      {
        "created_timestamp": 1601482652,
        "amount": "10.00",
        "currency": "USD",
        "sender": "",
        "type": "Payment",
        "payment_method": "VISA 414737-XX-XXXX-7712",
        "ip": ""
      },
      {
        "created_timestamp": 1586913321,
        "amount": "30.00",
        "currency": "USD",
        "sender": "Jessica Stephan",
        "receiver": "Shawn Hagene",
        "type": "Payment request",
        "status": "Canceled"
      },
      {
        "created_timestamp": 1582478410,
        "amount": "150.00",
        "currency": "USD",
        "sender": "Michele Dairda Obst",
        "receiver": "Shawn Hagene",
        "type": "Payment",
        "status": "Completed",
        "payment_data": {
          "p2p_payment": {
            "total_amount": "$150.00"
          }
        }
      },
      {
        "created_timestamp": 1553723157,
        "amount": "9.50",
        "currency": "USD",
        "sender": "",
        "type": "Payment",
        "payment_method": "VISA 414737-XX-XXXX-7712",
        "ip": ""
      },
      {
        "created_timestamp": 1452977657,
        "amount": "25.47",
        "currency": "USD",
        "sender": "",
        "type": "Payment",
        "payment_method": "Mastercard 556766-XX-XXXX-4747",
        "ip": ""
      },
      {
        "created_timestamp": 1434835053,
        "amount": "4.99",
        "currency": "USD",
        "sender": "",
        "receiver": "Dice with Buddies",
        "type": "Payment",
        "status": "Completed",
        "ip": "68.184.246.10"
      },
      {
        "created_timestamp": 1380025050,
        "amount": "1.00",
        "currency": "USD",
        "sender": "",
        "receiver": "Facebook Messages",
        "type": "Payment",
        "status": "Completed",
        "payment_method": "Mastercard ending in 2128",
        "ip": "71.86.43.154"
      }
    ]
  }
}